In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("advertising.csv")
data.head()

,Daily Time Spent on Site,Age,Area Income,Daily Internet Usage,Ad Topic Line,City,Male,Country,Timestamp,Clicked on Ad
0,68.95,35,61833.90,256.09,Cloned 5thgeneration orchestration,Wrightburgh,0,Tunisia,2016-03-27 00:53:11,0
1,80.23,31,68441.85,193.77,Monitored national standardization,West Jodi,1,Nauru,2016-04-04 01:39:02,0
2,69.47,26,59785.94,236.50,Organic bottom-line service-desk,Davidton,0,San Marino,2016-03-13 20:35:42,0
3,74.15,29,54806.18,245.89,Triple-buffered reciprocal time-frame,West Terrifurt,1,Italy,2016-01-10 02:31:19,0
4,68.37,35,73889.99,225.58,Robust logistical utilization,South Manuel,0,Iceland,2016-06-03 03:36:18,0

In [5]:
print(len(data))
data.describe()

1000

,Daily Time Spent on Site,Age,Area Income,Daily Internet Usage,Male,Clicked on Ad
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.00000
mean,65.000200,36.009000,55000.000080,180.000100,0.481000,0.50000
std,15.853615,8.785562,13414.634022,43.902339,0.499889,0.50025
min,32.600000,19.000000,13996.500000,104.780000,0.000000,0.00000
25%,51.360000,29.000000,47031.802500,138.830000,0.000000,0.00000
50%,68.215000,35.000000,57012.300000,183.130000,0.000000,0.50000
75%,78.547500,42.000000,65470.635000,218.792500,1.000000,1.00000
max,91.430000,61.000000,79484.800000,269.960000,1.000000,1.00000

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
Daily Time Spent on Site    1000 non-null float64
Age                         1000 non-null int64
Area Income                 1000 non-null float64
Daily Internet Usage        1000 non-null float64
Ad Topic Line               1000 non-null object
City                        1000 non-null object
Male                        1000 non-null int64
Country                     1000 non-null object
Timestamp                   1000 non-null object
Clicked on Ad               1000 non-null int64
dtypes: float64(3), int64(3), object(4)
memory usage: 78.2+ KB

### Finding the categorical variables and continuous variables

In [7]:
data.head()

,Daily Time Spent on Site,Age,Area Income,Daily Internet Usage,Ad Topic Line,City,Male,Country,Timestamp,Clicked on Ad
0,68.95,35,61833.90,256.09,Cloned 5thgeneration orchestration,Wrightburgh,0,Tunisia,2016-03-27 00:53:11,0
1,80.23,31,68441.85,193.77,Monitored national standardization,West Jodi,1,Nauru,2016-04-04 01:39:02,0
2,69.47,26,59785.94,236.50,Organic bottom-line service-desk,Davidton,0,San Marino,2016-03-13 20:35:42,0
3,74.15,29,54806.18,245.89,Triple-buffered reciprocal time-frame,West Terrifurt,1,Italy,2016-01-10 02:31:19,0
4,68.37,35,73889.99,225.58,Robust logistical utilization,South Manuel,0,Iceland,2016-06-03 03:36:18,0

In [10]:
data["Country"].value_counts()

France              9
Czech Republic      9
Afghanistan         8
Cyprus              8
Peru                8
                   ..
Jordan              1
Marshall Islands    1
Mozambique          1
Slovenia            1
Cape Verde          1
Name: Country, Length: 237, dtype: int64

In [11]:
data["Ad Topic Line"].value_counts()

Multi-tiered interactive neural-net                1
Proactive non-volatile encryption                  1
Pre-emptive systematic budgetary management        1
Cloned optimal leverage                            1
Universal transitional Graphical User Interface    1
                                                  ..
Exclusive multi-state Internet solution            1
Face-to-face reciprocal methodology                1
Total grid-enabled application                     1
Managed attitude-oriented Internet solution        1
Streamlined analyzing initiative                   1
Name: Ad Topic Line, Length: 1000, dtype: int64

In [13]:
data["City"].value_counts()

Lisamouth         3
Williamsport      3
Shelbyport        2
West Shannon      2
Michelleside      2
                 ..
Timothymouth      1
Robinsontown      1
Jacobstad         1
Novaktown         1
Hernandezville    1
Name: City, Length: 969, dtype: int64

Intially thought to consider country as categorical variable but way too many categories leading to a very sparse matrix.
Thus, City, country and Ad topic line are removed as part of feature engineering

In [15]:
X = data.drop(['City',"Ad Topic Line","Country","Clicked on Ad"],axis=1)

In [17]:
X.head()

,Daily Time Spent on Site,Age,Area Income,Daily Internet Usage,Male,Timestamp
0,68.95,35,61833.90,256.09,0,2016-03-27 00:53:11
1,80.23,31,68441.85,193.77,1,2016-04-04 01:39:02
2,69.47,26,59785.94,236.50,0,2016-03-13 20:35:42
3,74.15,29,54806.18,245.89,1,2016-01-10 02:31:19
4,68.37,35,73889.99,225.58,0,2016-06-03 03:36:18

In [18]:
X['Timestamp'] = pd.to_datetime(X['Timestamp'])

In [19]:
X.head()

,Daily Time Spent on Site,Age,Area Income,Daily Internet Usage,Male,Timestamp
0,68.95,35,61833.90,256.09,0,2016-03-27 00:53:11
1,80.23,31,68441.85,193.77,1,2016-04-04 01:39:02
2,69.47,26,59785.94,236.50,0,2016-03-13 20:35:42
3,74.15,29,54806.18,245.89,1,2016-01-10 02:31:19
4,68.37,35,73889.99,225.58,0,2016-06-03 03:36:18

In [21]:
X["Month"] = X["Timestamp"].dt.month
X["Day"] = X["Timestamp"].dt.day
X["Hour"] = X["Timestamp"].dt.hour

In [22]:
X.head()

,Daily Time Spent on Site,Age,Area Income,Daily Internet Usage,Male,Timestamp,Month,Day,Hour
0,68.95,35,61833.90,256.09,0,2016-03-27 00:53:11,3,27,0
1,80.23,31,68441.85,193.77,1,2016-04-04 01:39:02,4,4,1
2,69.47,26,59785.94,236.50,0,2016-03-13 20:35:42,3,13,20
3,74.15,29,54806.18,245.89,1,2016-01-10 02:31:19,1,10,2
4,68.37,35,73889.99,225.58,0,2016-06-03 03:36:18,6,3,3

In [23]:
X["Day of Week"] = X["Timestamp"].dt.dayofweek

In [52]:
Y.value_counts()

1    500
0    500
Name: Clicked on Ad, dtype: int64

In [25]:
Y = data["Clicked on Ad"]

In [24]:
from sklearn.model_selection import train_test_split

In [26]:
X_train,X_valid,Y_train,Y_valid = train_test_split(X,Y,test_size=.25,random_state=42)

In [27]:
len(X_train),len(Y_train),len(X_valid),len(Y_valid)

(750, 750, 250, 250)

In [28]:
from sklearn.ensemble import RandomForestClassifier

In [29]:
clf = RandomForestClassifier(n_estimators=20)

In [ ]:
X_train = X_train.drop("Timestamp",axis=1)

In [37]:
X_train

,Daily Time Spent on Site,Age,Area Income,Daily Internet Usage,Male,Month,Day,Hour,Day of Week
82,56.64,38,61652.53,115.91,0,1,5,17,1
991,38.96,38,36497.22,140.67,1,7,21,16,3
789,40.88,33,48554.45,136.18,1,5,31,17,1
894,85.37,36,66262.59,194.56,1,1,27,17,2
398,76.24,40,75524.78,198.32,1,5,31,23,1
...,...,...,...,...,...,...,...,...,...
106,72.23,25,46557.92,241.03,1,7,5,17,1
270,44.49,53,63100.13,168.00,1,4,23,6,5
860,91.37,45,51920.49,182.65,1,4,1,7,4
435,56.66,42,72684.44,139.42,0,2,20,10,5
102,89.91,40,59593.56,194.23,0,7,9,14,5

In [40]:
X_valid = X_valid.drop(["Timestamp"],axis=1)

In [41]:
X_valid.head()

,Daily Time Spent on Site,Age,Area Income,Daily Internet Usage,Male,Month,Day,Hour,Day of Week
521,63.26,29,54787.37,120.46,1,3,2,4,2
737,71.23,52,41521.28,122.59,0,1,5,11,1
740,43.63,38,61757.12,135.25,1,5,25,19,2
660,42.04,49,67323.00,182.11,0,2,3,16,2
411,78.68,29,66225.72,208.05,0,1,16,16,5

In [42]:
clf.fit(X_train,Y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=None, max_features='auto', max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=20,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [43]:
clf.score(X_valid,Y_valid)

0.932

In [44]:
y_preds = clf.predict(X_valid)

In [45]:
from sklearn.metrics import accuracy_score,confusion_matrix,classification_report

In [48]:
accuracy = accuracy_score(Y_valid,y_preds)
accuracy

0.932

In [49]:
print(classification_report(Y_valid,y_preds))

              precision    recall  f1-score   support

           0       0.92      0.94      0.93       120
           1       0.94      0.92      0.93       130

    accuracy                           0.93       250
   macro avg       0.93      0.93      0.93       250
weighted avg       0.93      0.93      0.93       250